In [1]:
import seaborn as sns
import pandas as pd
import numpy as np

In [2]:
tips = sns.load_dataset('tips')
tips.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [8]:
tips_gb = tips.groupby(['sex','smoker'])
tips_gb

In [10]:
tips_agg = tips_gb.agg({
    'tip': ['mean', 'min'],
    'day': 'first',
    'total_bill': 'size'
})
tips_agg

                    tip         day total_bill
                   mean   min first       size
sex    smoker
Male   Yes     3.051167  1.00   Sat         60
       No      3.113402  1.25   Sun         97
Female Yes     2.931515  1.00   Sat         33
       No      2.773519  1.00   Sun         54

In [11]:
tips_agg.reset_index()

      sex smoker       tip         day total_bill
                      mean   min first       size
0    Male    Yes  3.051167  1.00   Sat         60
1    Male     No  3.113402  1.25   Sun         97
2  Female    Yes  2.931515  1.00   Sat         33
3  Female     No  2.773519  1.00   Sun         54

In [12]:
tips_agg.columns

MultiIndex([(       'tip',  'mean'),
            (       'tip',   'min'),
            (       'day', 'first'),
            ('total_bill',  'size')],
           )

In [13]:
tips_agg.stack()

                          tip  day  total_bill
sex    smoker
Male   Yes    first       NaN  Sat         NaN
              mean   3.051167  NaN         NaN
              min    1.000000  NaN         NaN
              size        NaN  NaN        60.0
       No     first       NaN  Sun         NaN
              mean   3.113402  NaN         NaN
              min    1.250000  NaN         NaN
              size        NaN  NaN        97.0
Female Yes    first       NaN  Sat         NaN
              mean   2.931515  NaN         NaN
              min    1.000000  NaN         NaN
              size        NaN  NaN        33.0
       No     first       NaN  Sun         NaN
              mean   2.773519  NaN         NaN
              min    1.000000  NaN         NaN
              size        NaN  NaN        54.0

In [14]:
tips_agg.columns = ['__'.join(col).strip() for col in tips_agg.columns.values]
tips_agg.columns

Index(['tip__mean', 'tip__min', 'day__first', 'total_bill__size'], dtype='object')

In [15]:
tips_agg

               tip__mean  tip__min day__first  total_bill__size
sex    smoker
Male   Yes      3.051167      1.00        Sat                60
       No       3.113402      1.25        Sun                97
Female Yes      2.931515      1.00        Sat                33
       No       2.773519      1.00        Sun                54

In [16]:
tips_gb = tips.groupby(['day', 'time'])

In [20]:
median_size = tips_gb.agg({'size': 'sum'}).median()[0]
median_size

20.0

In [22]:
tips_gb.filter(lambda group: group.size.sum() < median_size).head()

     total_bill  tip     sex smoker   day    time  size
243       18.78  3.0  Female     No  Thur  Dinner     2

In [23]:
tips_gb = tips.groupby(['day'])
tips_gb

In [24]:
tips_gb[['total_bill', 'tip']].transform(lambda x: x/x.mean()).head()

   total_bill       tip
0    0.793554  0.310279
1    0.482952  0.509964
2    0.981317  1.075225
3    1.106025  1.016856
4    1.148529  1.109018